hathach/tinyusb/src/portable/microchip/sam3u/samhs_sam3u.h
#define SAMHS_DEV_EPTSTA_TXRDY (0x1u << 11) /**< \brief (SAMHS_DEV_EPTSTA) TX Packet Ready */
#define SAMHS_DEV_EPTSTA_RX_SETUP (0x1u << 12) /**< \brief (SAMHS_DEV_EPTSTA) Received SETUP */
#define SAMHS_DEV_EPTSTA_STALL_SNT (0x1u << 13) /**< \brief (SAMHS_DEV_EPTSTA) Stall Sent */
#define SAMHS_DEV_EPTSTA_NAK_IN (0x1u << 14) /**< \brief (SAMHS_DEV_EPTSTA) NAK IN */
#define SAMHS_DEV_EPTSTA_NAK_OUT (0x1u << 15) /**< \brief (SAMHS_DEV_EPTSTA) NAK OUT */
#define SAMHS_DEV_EPTSTA_CURBK_CTLDIR_Pos 16
#define SAMHS_DEV_EPTSTA_CURBK_CTLDIR_Msk (0x3u << SAMHS_DEV_EPTSTA_CURBK_CTLDIR_Pos) /**< \brief (SAMHS_DEV_EPTSTA) Current Bank/Control Direction */
#define SAMHS_DEV_EPTSTA_BUSY_BANK_STA_Pos 18
#define SAMHS_DEV_EPTSTA_BUSY_BANK_STA_Msk (0x3u << SAMHS_DEV_EPTSTA_BUSY_BANK_STA_Pos) /**< \brief (SAMHS_DEV_EPTSTA) Busy Bank Number */
#define   SAMHS_DEV_EPTSTA_BUSY_BANK_STA_1BUSYBANK (0x0u << 18) /**< \brief (SAMHS_DEV_EPTSTA) 1 busy bank */
#define   SAMHS_DEV_EPTSTA_BUSY_BANK_STA_2BUSYBANKS (0x1u << 18) /**< \brief (SAMHS_DEV_EPTSTA) 2 busy banks */
#define   SAMHS_DEV_EPTSTA_BUSY_BANK_STA_3BUSYBANKS (0x2u << 18) /**< \brief (SAMHS_DEV_EPTSTA) 3 busy banks */
#define SAMHS_DEV_EPTSTA_BYTE_COUNT_Pos 20
#define SAMHS_DEV_EPTSTA_BYTE_COUNT_Msk (0x7ffu << SAMHS_DEV_EPTSTA_BYTE_COUNT_Pos) /**< \brief (SAMHS_DEV_EPTSTA) SAMHS Byte Count */
#define SAMHS_DEV_EPTSTA_SHRT_PCKT (0x1u << 31) /**< \brief (SAMHS_DEV_EPTSTA) Short Packet */
#define SAMHS_DEV_EPTSTA_TXRDY_TRER (0x1u << 11) /**< \brief (SAMHS_DEV_EPTSTA) TX Packet Ready/Transaction Error */
#define SAMHS_DEV_EPTSTA_ERR_FL_ISO (0x1u << 12) /**< \brief (SAMHS_DEV_EPTSTA) Error Flow */
#define SAMHS_DEV_EPTSTA_ERR_CRC_NTR (0x1u << 13) /**< \brief (SAMHS_DEV_EPTSTA) CRC ISO Error/Number of Transaction Error */
#define SAMHS_DEV_EPTSTA_ERR_FLUSH (0x1u << 14) /**< \brief (SAMHS_DEV_EPTSTA) Bank Flush Error */
#define SAMHS_DEV_EPTSTA_CURBK_Pos 16
#define SAMHS_DEV_EPTSTA_CURBK_Msk (0x3u << SAMHS_DEV_EPTSTA_CURBK_Pos) /**< \brief (SAMHS_DEV_EPTSTA) Current Bank */
#define   SAMHS_DEV_EPTSTA_CURBK_BANK0 (0x0u << 16) /**< \brief (SAMHS_DEV_EPTSTA) Bank 0 (or single bank) */
#define   SAMHS_DEV_EPTSTA_CURBK_BANK1 (0x1u << 16) /**< \brief (SAMHS_DEV_EPTSTA) Bank 1 */
#define   SAMHS_DEV_EPTSTA_CURBK_BANK2 (0x2u << 16) /**< \brief (SAMHS_DEV_EPTSTA) Bank 2 */
/* -------- SAMHS_DEV_DMANXTDSC : (SAMHS Offset: N/A) SAMHS DMA Next Descriptor Address Register -------- */
#define SAMHS_DEV_DMANXTDSC_NXT_DSC_ADD_Pos 0
#define SAMHS_DEV_DMANXTDSC_NXT_DSC_ADD_Msk (0xffffffffu << SAMHS_DEV_DMANXTDSC_NXT_DSC_ADD_Pos) /**< \brief (SAMHS_DEV_DMANXTDSC) Next Descriptor Address */
#define SAMHS_DEV_DMANXTDSC_NXT_DSC_ADD(value) ((SAMHS_DEV_DMANXTDSC_NXT_DSC_ADD_Msk & ((value) << SAMHS_DEV_DMANXTDSC_NXT_DSC_ADD_Pos)))
/* -------- SAMHS_DEV_DMAADDRESS : (SAMHS Offset: N/A) SAMHS DMA Channel Address Register -------- */
#define SAMHS_DEV_DMAADDRESS_BUFF_ADD_Pos 0
#define SAMHS_DEV_DMAADDRESS_BUFF_ADD_Msk (0xffffffffu << SAMHS_DEV_DMAADDRESS_BUFF_ADD_Pos) /**< \brief (SAMHS_DEV_DMAADDRESS) Buffer Address */
#define SAMHS_DEV_DMAADDRESS_BUFF_ADD(value) ((SAMHS_DEV_DMAADDRESS_BUFF_ADD_Msk & ((value) << SAMHS_DEV_DMAADDRESS_BUFF_ADD_Pos)))
/* -------- SAMHS_DEV_DMACONTROL : (SAMHS Offset: N/A) SAMHS DMA Channel Control Register -------- */
#define SAMHS_DEV_DMACONTROL_CHANN_ENB (0x1u << 0) /**< \brief (SAMHS_DEV_DMACONTROL) (Channel Enable Command) */
#define SAMHS_DEV_DMACONTROL_LDNXT_DSC (0x1u << 1) /**< \brief (SAMHS_DEV_DMACONTROL) Load Next Channel Transfer Descriptor Enable (Command) */
#define SAMHS_DEV_DMACONTROL_END_TR_EN (0x1u << 2) /**< \brief (SAMHS_DEV_DMACONTROL) End of Transfer Enable (Control) */
#define SAMHS_DEV_DMACONTROL_END_B_EN (0x1u << 3) /**< \brief (SAMHS_DEV_DMACONTROL) End of Buffer Enable (Control) */
#define SAMHS_DEV_DMACONTROL_END_TR_IT (0x1u << 4) /**< \brief (SAMHS_DEV_DMACONTROL) End of Transfer Interrupt Enable */
#define SAMHS_DEV_DMACONTROL_END_BUFFIT (0x1u << 5) /**< \brief (SAMHS_DEV_DMACONTROL) End of Buffer Interrupt Enable */
#define SAMHS_DEV_DMACONTROL_DESC_LD_IT (0x1u << 6) /**< \brief (SAMHS_DEV_DMACONTROL) Descriptor Loaded Interrupt Enable */
#define SAMHS_DEV_DMACONTROL_BURST_LCK (0x1u << 7) /**< \brief (SAMHS_DEV_DMACONTROL) Burst Lock Enable */
#define SAMHS_DEV_DMACONTROL_BUFF_LENGTH_Pos 16
#define SAMHS_DEV_DMACONTROL_BUFF_LENGTH_Msk (0xffffu << SAMHS_DEV_DMACONTROL_BUFF_LENGTH_Pos) /**< \brief (SAMHS_DEV_DMACONTROL) Buffer Byte Length (Write-only) */
#define SAMHS_DEV_DMACONTROL_BUFF_LENGTH(value) ((SAMHS_DEV_DMACONTROL_BUFF_LENGTH_Msk & ((value) << SAMHS_DEV_DMACONTROL_BUFF_LENGTH_Pos)))
/* -------- SAMHS_DEV_DMASTATUS : (SAMHS Offset: N/A) SAMHS DMA Channel Status Register -------- */
#define SAMHS_DEV_DMASTATUS_CHANN_ENB (0x1u << 0) /**< \brief (SAMHS_DEV_DMASTATUS) Channel Enable Status */
#define SAMHS_DEV_DMASTATUS_CHANN_ACT (0x1u << 1) /**< \brief (SAMHS_DEV_DMASTATUS) Channel Active Status */
#define SAMHS_DEV_DMASTATUS_END_TR_ST (0x1u << 4) /**< \brief (SAMHS_DEV_DMASTATUS) End of Channel Transfer Status */
#define SAMHS_DEV_DMASTATUS_END_BF_ST (0x1u << 5) /**< \brief (SAMHS_DEV_DMASTATUS) End of Channel Buffer Status */
#define SAMHS_DEV_DMASTATUS_DESC_LDST (0x1u << 6) /**< \brief (SAMHS_DEV_DMASTATUS) Descriptor Loaded Status */
#define SAMHS_DEV_DMASTATUS_BUFF_COUNT_Pos 16
#define SAMHS_DEV_DMASTATUS_BUFF_COUNT_Msk (0xffffu << SAMHS_DEV_DMASTATUS_BUFF_COUNT_Pos) /**< \brief (SAMHS_DEV_DMASTATUS) Buffer Byte Count */
#define SAMHS_DEV_DMASTATUS_BUFF_COUNT(value) ((SAMHS_DEV_DMASTATUS_BUFF_COUNT_Msk & ((value) << SAMHS_DEV_DMASTATUS_BUFF_COUNT_Pos)))


/** \brief samhs_dma hardware registers */
typedef struct {
  __IO uint32_t SAMHS_DEV_DMANXTDSC;  /**< \brief (samhs_dma Offset: 0x0) SAMHS DMA Next Descriptor Address Register */
  __IO uint32_t SAMHS_DEV_DMAADDRESS; /**< \brief (samhs_dma Offset: 0x4) SAMHS DMA Channel Address Register */
  __IO uint32_t SAMHS_DEV_DMACONTROL; /**< \brief (samhs_dma Offset: 0x8) SAMHS DMA Channel Control Register */
  __IO uint32_t SAMHS_DEV_DMASTATUS;  /**< \brief (samhs_dma Offset: 0xC) SAMHS DMA Channel Status Register */
} samhs_dma_t;

/** \brief samhs_ept hardware registers */
typedef struct {
  __IO uint32_t SAMHS_DEV_EPTCFG;    /**< \brief (samhs_ept Offset: 0x0) SAMHS Endpoint Configuration Register */
  __O  uint32_t SAMHS_DEV_EPTCTLENB; /**< \brief (samhs_ept Offset: 0x4) SAMHS Endpoint Control Enable Register */
  __O  uint32_t SAMHS_DEV_EPTCTLDIS; /**< \brief (samhs_ept Offset: 0x8) SAMHS Endpoint Control Disable Register */
  __I  uint32_t SAMHS_DEV_EPTCTL;    /**< \brief (samhs_ept Offset: 0xC) SAMHS Endpoint Control Register */
  __I  uint32_t Reserved1[1];
  __O  uint32_t SAMHS_DEV_EPTSETSTA; /**< \brief (samhs_ept Offset: 0x14) SAMHS Endpoint Set Status Register */
  __O  uint32_t SAMHS_DEV_EPTCLRSTA; /**< \brief (samhs_ept Offset: 0x18) SAMHS Endpoint Clear Status Register */
  __I  uint32_t SAMHS_DEV_EPTSTA;    /**< \brief (samhs_ept Offset: 0x1C) SAMHS Endpoint Status Register */
} samhs_ept_t;

