hathach/tinyusb/src/portable/microchip/sam3u/samhs_sam3u.h
/** \brief samhs_reg hardware registers */
#define SAMHS_EPT_NUMBER 7
#define SAMHS_DMA_NUMBER 6

typedef struct {
  __IO uint32_t SAMHS_DEV_CTRL;                 /**< \brief (samhs_reg Offset: 0x00) SAMHS Control Register */
  __I  uint32_t SAMHS_DEV_FNUM;                 /**< \brief (samhs_reg Offset: 0x04) SAMHS Frame Number Register */
  __I  uint32_t Reserved1[2];
  __IO uint32_t SAMHS_DEV_IEN;                  /**< \brief (samhs_reg Offset: 0x10) SAMHS Interrupt Enable Register */
  __I  uint32_t SAMHS_DEV_INTSTA;               /**< \brief (samhs_reg Offset: 0x14) SAMHS Interrupt Status Register */
  __O  uint32_t SAMHS_DEV_CLRINT;               /**< \brief (samhs_reg Offset: 0x18) SAMHS Clear Interrupt Register */
  __O  uint32_t SAMHS_DEV_EPTRST;               /**< \brief (samhs_reg Offset: 0x1C) SAMHS Endpoints Reset Register */
  __I  uint32_t Reserved2[48];
  __IO uint32_t SAMHS_DEV_TST;                  /**< \brief (samhs_reg Offset: 0xE0) SAMHS Test Register */
  __I  uint32_t Reserved3[7];
       samhs_ept_t SAMHS_DEV_EPT[SAMHS_EPT_NUMBER]; /**< \brief (samhs_reg Offset: 0x100) endpoint = 0 .. 6 */
  __I  uint32_t Reserved4[72];
       samhs_dma_t SAMHS_DEV_DMA[SAMHS_DMA_NUMBER]; /**< \brief (samhs_reg Offset: 0x300) channel = 0 .. 5 */
} samhs_reg_t;

#define SAMHS_BASE_REG		(0x400A4000U)         /**< \brief (USBHS) Base Address */

#define EP_MAX           	7

#define FIFO_RAM_ADDR		(0x20180000U)

// Errata: The DMA feature is not available for Pipe/Endpoint 7
#define EP_DMA_SUPPORT(epnum) (epnum >= 1 && epnum <= 6)

#endif /* _SAMHS_SAM3U_H_ */
